Repository: attatabey1/nextstep-backend
Catalog: config/locale/*/LC_MESSAGES/django.po
Languages: ps

source: Login
ps: ننوتل

source: Welcome back
ps: بېرته ښه راغلاست

source: Login to apply and manage your account.
ps: د غوښتنې او د خپل حساب د مدیریت لپاره ننوتل.

source: Please correct the errors below.
ps: مهرباني وکړئ لاندې تېروتنې اصلاح کړئ.

source: Username
ps: کارن نوم

source: Enter your username
ps: خپل کارن نوم داخل کړئ

source: Password
ps: رمز

source: Enter your password
ps: خپل رمز داخل کړئ

source: Don't have an account?
ps: حساب نلرئ؟

source: Sign up
ps: حساب جوړ کړئ

source: Back to Home
ps: کور ته بېرته

source: Create account
ps: حساب جوړول

source: Register to apply and subscribe.
ps: د غوښتنې او ګډون لپاره ثبت شئ.

source: Email
ps: برېښنالیک

source: Email address
ps: د برېښنالیک پته

source: Create a strong password
ps: یو قوي رمز جوړ کړئ

source: Use at least 8 characters
ps: تر لږه ۸ توري وکاروئ

source: Mix letters and numbers
ps: حروف او شمېرې ګډ کړئ

source: Avoid common passwords
ps: عادي رمزونه مه کاروئ

source: Confirm password
ps: رمز تایید کړئ

source: Repeat the same password
ps: هماغه رمز بیا تکرار کړئ

source: Already have an account?
ps: آیا حساب لرئ؟

source: Home
ps: کور

source: Browse
ps: کتل

source: Closing soon
ps: ژر بندېږي

source: Services
ps: خدمات

source: Gallery
ps: ګالري

source: Contact
ps: اړیکه

source: visits
ps: کتنې

source: Logout
ps: وتل

source: Admin
ps: اداره

source: All rights reserved
ps: ټولې حقوق خوندي دي

source: Remote
ps: انلاین

source: Featured
ps: ځانګړي

source: Organization
ps: سازمان

source: views
ps: کتنې

source: Save
ps: خوندي کړئ

source: Login to save
ps: د خوندي کولو لپاره ننوتل

source: Country
ps: هېواد

source: Deadline
ps: وروستۍ نېټه

source: No deadline
ps: وروستۍ نېټه نه لري

source: Description
ps: تفصیل

source: Apply
ps: غوښتنه

source: Use the official link to apply. Always verify details on the original website.
ps: د غوښتنلیک لپاره رسمي لینک وکاروئ. تل د اصلي ویبپاڼې معلومات تایید کړئ.

source: Apply on official website
ps: په رسمي ویبپاڼه کې غوښتنه وکړئ

source: No apply link provided yet.
ps: تر اوسه لپاره د غوښتنې لینک نه دی ورکړل شوی.

source: Back to listings
ps: بېرته اعلانونو ته

source: Find Jobs, Scholarships & Courses — fast.
ps: دندې، بورسونه او کورسونه ژر ومومئ

source: Search opportunities and apply directly. Built for people who want the next step.
ps: فرصتونه ولټوئ او مستقیم غوښتنلیک ورکړئ. د راتلونکې پړاو لپاره جوړ شوی.

source: Search by title, organization, country...
ps: د سرلیک، ادارې یا هېواد له مخې ولټوئ

source: All types
ps: ټول ډولونه

source: Job
ps: دنده

source: Scholarship
ps: بورس

source: Course
ps: کورس

source: Search
ps: لټون

source: Jobs
ps: دندې

source: Scholarships
ps: بورسونه

source: Courses
ps: کورسونه

source: Remote only
ps: یوازې انلاین

source: Browse all
ps: ټول وګورئ

source: No featured listings yet. Mark some items as Featured in Admin.
ps: تر اوسه ځانګړي اعلانونه نشته. له ادارې څخه ځینې اعلانونه ځانګړي وټاکئ.

source: Latest
ps: وروستي

source: See more
ps: نور وګورئ

source: No listings yet. Add items from Admin.
ps: تر اوسه اعلانونه نشته. له ادارې اعلانونه اضافه کړئ.

source: Built with Django + PostgreSQL
ps: د Django او PostgreSQL په وسیله جوړ شوی

source: Search jobs, scholarships, courses...
ps: دندې، بورسونه او کورسونه ولټوئ

source: Reset
ps: بیا تنظیم

source: Browse Opportunities
ps: فرصتونه وګورئ

source: Find jobs, scholarships, and courses — apply directly.
ps: دندې، بورسونه او کورسونه ومومئ او مستقیم غوښتنه وکړئ.

source: Showing
ps: ښودل کېږي

source: of
ps: له

source: Type
ps: ډول

source: All
ps: ټول

source: e.g., Afghanistan
ps: لکه: افغانستان

source: Any
ps: هر یو

source: Apply filters
ps: فلټرونه تطبیق کړئ

source: View
ps: کتل

source: No listings found. Try changing filters or add items from Admin.
ps: هیڅ اعلان ونه موندل شو. فلټرونه بدل کړئ یا له ادارې اعلان اضافه کړئ.

source: Page
ps: پاڼه

source: Prev
ps: مخکینی

source: Next
ps: بل

source: Contact Us
ps: موږ سره اړیکه ونیسئ

source: Send us a message and we will reply soon.
ps: موږ ته پیغام واستوئ او ژر به مو ځواب درکړو.

source: Name
ps: نوم

source: Message
ps: پیغام

source: Send message
ps: پیغام واستوئ

source: Highlights, events, partners, and announcements.
ps: مهمې پېښې، شریکان او اعلانونه.

source: Manage in Admin
ps: په اډمین کې مدیریت

source: View image
ps: انځور وګورئ

source: Untitled
ps: بې سرلیک

source: Like
ps: خوښول

source: Open
ps: خلاص

source: Download
ps: ډاونلوډ

source: Close
ps: بندول

source: Our Services
ps: زموږ خدمات

source: We help you find opportunities and apply faster.
ps: موږ تاسو سره د فرصتونو موندلو او په چټکۍ سره غوښتنې کې مرسته کوو.
